---
kind: method
id: M:Autodesk.Revit.DB.MEPSystem.GetSectionByNumber(System.Int32)
zh: 系统
source: html/11cc783a-32f8-b0e0-2da6-5ecc6b9e57a6.htm
---
# Autodesk.Revit.DB.MEPSystem.GetSectionByNumber Method

**中文**: 系统

Get the Section from section number

## Syntax (C#)
```csharp
public MEPSection GetSectionByNumber(
	int sectionNumber
)
```

## Parameters
- **sectionNumber** (`System.Int32`) - The Section number.

## Returns
The section. Nothing nullptr a null reference ( Nothing in Visual Basic) if the no section exists for the input section number.